-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Sep 14, 2025 at 08:04 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `student_owen_database`
--

-- --------------------------------------------------------

--
-- Table structure for table `tb_ursername`
--

CREATE TABLE `tb_ursername` (
  `id` int(11) NOT NULL,
  `Number` int(3) NOT NULL,
  `Code` varchar(10) NOT NULL,
  `pname` varchar(10) NOT NULL,
  `name` varchar(50) NOT NULL,
  `last_name` varchar(50) NOT NULL,
  `classroom` varchar(5) NOT NULL,
  `Email` varchar(100) NOT NULL,
  `password` varchar(225) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `tb_ursername`
--

INSERT INTO `tb_ursername` (`id`, `Number`, `Code`, `pname`, `name`, `last_name`, `classroom`, `Email`, `password`) VALUES
(82, 0, 'Code', 'pname', 'name', 'last_name', 'class', 'Email', 'password'),
(83, 1, '39184', 'ด.ช.', 'กฤติน', 'ลิ้มสวรรค์', '211', '39184@bpk.ac.th', '123'),
(84, 2, '39185', 'ด.ช.', 'กันตภณ', 'เอื้อจิตร', '211', '39185@bpk.ac.th', '123'),
(85, 3, '39186', 'ด.ช.', 'ธีรเมธ', 'ชอบหาญ', '211', '39186@bpk.ac.th', '123'),
(86, 4, '39188', 'ด.ช.', 'ชินภัทร', 'มนตรี', '211', '39188@bpk.ac.th', '123'),
(87, 5, '39189', 'ด.ช.', 'ญาณวุฒิ', 'บรรหารสกุล', '211', '39189@bpk.ac.th', '123'),
(88, 6, '39190', 'ด.ช.', 'วัชรมงคล', 'โพธิ์แสงดา', '211', '39190@bpk.ac.th', '123'),
(89, 7, '39191', 'ด.ช.', 'ทัยสันต์', 'สิริกชกร', '211', '39191@bpk.ac.th', '123'),
(90, 8, '39192', 'ด.ช.', 'ธนพัต', 'รุ่งเรืองสาร', '211', '39192@bpk.ac.th', '123'),
(91, 9, '39193', 'ด.ช.', 'ธรรณธร', 'สงแจ้ง', '211', '39193@bpk.ac.th', '123'),
(92, 10, '39194', 'ด.ช.', 'ธัญวรัตน์', 'วิทยกุล', '211', '39194@bpk.ac.th', '123'),
(93, 11, '39195', 'ด.ช.', 'ปรกบุญ', 'ขลุ่ยแก้ว', '211', '39195@bpk.ac.th', '123'),
(94, 12, '39196', 'ด.ช.', 'พุฒิพงศ์', 'ภูทองบ่อ', '211', '39196@bpk.ac.th', '123'),
(95, 13, '39197', 'ด.ช.', 'ภูเดชา', 'พรมเรือน', '211', '39197@bpk.ac.th', '123'),
(96, 14, '39198', 'ด.ช.', 'วชิรวิทย์', 'ตั้งวัฒนะกุล', '211', '39198@bpk.ac.th', '123'),
(97, 15, '39199', 'ด.ช.', 'อัณณ์อธิป', 'พงษ์จินดากร', '211', '39199@bpk.ac.th', '123'),
(98, 16, '39200', 'ด.ช.', 'อัศม์เดช', 'บุญญามิ่ง', '211', '39200@bpk.ac.th', '123'),
(99, 17, '39206', 'ด.ช.', 'ปภังกร', 'น้อยอิ่ม', '211', '39206@bpk.ac.th', '123'),
(100, 18, '39209', 'ด.ช.', 'ปณิธิ', 'ฝอยทอง', '211', '39209@bpk.ac.th', '123'),
(101, 19, '39214', 'ด.ช.', 'ณัทกร', 'วัฒนะภาราดา', '211', '39214@bpk.ac.th', '123'),
(102, 20, '39219', 'ด.ช.', 'กานต์เกล้า', 'คงนวล', '211', '39219@bpk.ac.th', '123'),
(103, 21, '39187', 'ด.ญ.', 'บุญญาพร', 'ไพโรจน์ฤทธิ์กุล', '211', '39187@bpk.ac.th', '123'),
(104, 22, '39201', 'ด.ญ.', 'กัลยรัตน์', 'ขวัญมาก', '211', '39201@bpk.ac.th', '123'),
(105, 23, '39202', 'ด.ญ.', 'ขวัญหทัย', 'สาวเพชรดี', '211', '39202@bpk.ac.th', '123'),
(106, 24, '39203', 'ด.ญ.', 'จารุมนวรรณ', 'บุญงามทวีทรัพย์', '211', '39203@bpk.ac.th', '123'),
(107, 25, '39204', 'ด.ญ.', 'ชาลิสา', 'วิลัยวรรณ์', '211', '39204@bpk.ac.th', '123'),
(108, 26, '39205', 'ด.ญ.', 'ญาดา', 'คำงาม', '211', '39205@bpk.ac.th', '123'),
(109, 27, '39207', 'ด.ญ.', 'นภัสสร', 'วุ่นยรรยงค์', '211', '39207@bpk.ac.th', '123'),
(110, 28, '39208', 'ด.ญ.', 'นันท์นภัส', 'นราพิริยานนท์', '211', '39208@bpk.ac.th', '123'),
(111, 29, '39210', 'ด.ญ.', 'ณัฐนันท์', 'สีนา', '211', '39210@bpk.ac.th', '123'),
(112, 30, '39211', 'ด.ญ.', 'ปวิชญา', 'บุญหลวง', '211', '39211@bpk.ac.th', '123'),
(113, 31, '39212', 'ด.ญ.', 'ปัณฑารีย์', 'เจริญฤทธิ์', '211', '39212@bpk.ac.th', '123'),
(114, 32, '39213', 'ด.ญ.', 'พริมดาสิริ', 'จันทร์ชิดฟ้า', '211', '39213@bpk.ac.th', '123'),
(115, 33, '39215', 'ด.ญ.', 'ภภรกัญ', 'พาป้อ', '211', '39215@bpk.ac.th', '123'),
(116, 34, '39216', 'ด.ญ.', 'ภัชชนก', 'อภินันทโชค', '211', '39216@bpk.ac.th', '123'),
(117, 35, '39217', 'ด.ญ.', 'ศศิวิมล', 'ขันคำ', '211', '39217@bpk.ac.th', '123'),
(118, 36, '39218', 'ด.ญ.', 'ปาณิสรา', 'นิตไธสง', '211', '39218@bpk.ac.th', '123'),
(119, 37, '39220', 'ด.ช.', 'ก้องภพ', 'รุ่งรัศมี', '212', '39220@bpk.ac.th', '123'),
(120, 38, '39221', 'ด.ช.', 'ก้องภพ', 'กองประมูล', '212', '39221@bpk.ac.th', '123'),
(121, 39, '39222', 'ด.ช.', 'กาญจน์ณวุฒิ', 'ไชยวงษ์', '212', '39222@bpk.ac.th', '123'),
(122, 40, '39223', 'ด.ช.', 'ชนุดม', 'สมฤทธิ์', '212', '39223@bpk.ac.th', '123'),
(123, 41, '39224', 'ด.ช.', 'ณัฐณพีร์', 'วิมานอมรแมน', '212', '39224@bpk.ac.th', '123'),
(124, 42, '39226', 'ด.ช.', 'ก้องภพ', 'ราชเจริญ', '212', '39226@bpk.ac.th', '123'),
(125, 43, '39227', 'ด.ช.', 'ทยากร', 'บุพอังกูร', '212', '39227@bpk.ac.th', '123'),
(126, 44, '39229', 'ด.ช.', 'พชรดนัย', 'น้อยสุทธิสกุล', '212', '39229@bpk.ac.th', '123'),
(127, 45, '39230', 'ด.ช.', 'พศิน', 'พลฉวี', '212', '39230@bpk.ac.th', '123'),
(128, 46, '39231', 'ด.ช.', 'เมธัส', 'เจียนกระโทก', '212', '39231@bpk.ac.th', '123'),
(129, 47, '39232', 'ด.ช.', 'วรพงศ์', 'กรรมจันทร์', '212', '39232@bpk.ac.th', '123'),
(130, 48, '39233', 'ด.ช.', 'ศิริวัฒน์', 'ศิริพานกุล', '212', '39233@bpk.ac.th', '123'),
(131, 49, '39234', 'ด.ช.', 'อธิวัฒน์', 'ประดับดี', '212', '39234@bpk.ac.th', '123'),
(132, 50, '39235', 'ด.ช.', 'อริย์ธัช', 'ชุมศรี', '212', '39235@bpk.ac.th', '123'),
(133, 51, '39237', 'ด.ช.', 'อัศวิน', 'สาโรวาท', '212', '39237@bpk.ac.th', '123'),
(134, 52, '39244', 'ด.ช.', 'ชินาธิป', 'กล่ำแสง', '212', '39244@bpk.ac.th', '123'),
(135, 53, '39249', 'ด.ช.', 'ธนวัสส์', 'อาภาประสิทธิ์', '212', '39249@bpk.ac.th', '123'),
(136, 54, '39255', 'ด.ช.', 'สหัติเธียร', 'จันทโสก', '212', '39255@bpk.ac.th', '123'),
(137, 55, '39225', 'ด.ญ.', 'นิธินันท์', 'อริยะทวีพงษ์', '212', '39225@bpk.ac.th', '123'),
(138, 56, '39228', 'ด.ญ.', 'ศรัณยวิทย์', 'ใหม่หะลา', '212', '39228@bpk.ac.th', '123'),
(139, 57, '39236', 'ด.ญ.', 'กชพรรษ', 'ภทรปรีชาชัย', '212', '39236@bpk.ac.th', '123'),
(140, 58, '39238', 'ด.ญ.', 'กานต์เกล้า', 'น้อยนาค', '212', '39238@bpk.ac.th', '123'),
(141, 59, '39239', 'ด.ญ.', 'คีตภัทร', 'สายแก้ว', '212', '39239@bpk.ac.th', '123'),
(142, 60, '39240', 'ด.ญ.', 'ณฐพร', 'ระดาพงษ์', '212', '39240@bpk.ac.th', '123'),
(143, 61, '39241', 'ด.ญ.', 'นภสร', 'สังข์ทอง', '212', '39241@bpk.ac.th', '123'),
(144, 62, '39242', 'ด.ญ.', 'บัณฑิตา', 'ศรีวิโรจน์', '212', '39242@bpk.ac.th', '123'),
(145, 63, '39243', 'ด.ญ.', 'ปพิชญา', 'บัวเหม', '212', '39243@bpk.ac.th', '123'),
(146, 64, '39245', 'ด.ญ.', 'ปุณณภา', 'สิงหดำรงกิจ', '212', '39245@bpk.ac.th', '123'),
(147, 65, '39246', 'ด.ญ.', 'ปุณณิศา', 'สงวนศรี', '212', '39246@bpk.ac.th', '123'),
(148, 66, '39247', 'ด.ญ.', 'พิชญาภา', 'อุดมศรี', '212', '39247@bpk.ac.th', '123'),
(149, 67, '39248', 'ด.ญ.', 'ภัทรจารีย์', 'ดอกนาค', '212', '39248@bpk.ac.th', '123'),
(150, 68, '39250', 'ด.ญ.', 'รัมภาชไม', 'รอดเรือง', '212', '39250@bpk.ac.th', '123'),
(151, 69, '39251', 'ด.ญ.', 'ร่ำซำ', 'ฤกษ์อริยะ', '212', '39251@bpk.ac.th', '123'),
(152, 70, '39252', 'ด.ญ.', 'รินรดา', 'เชื้อทอง', '212', '39252@bpk.ac.th', '123'),
(153, 71, '39253', 'ด.ญ.', 'รินลดา', 'บัตรพันชนะ', '212', '39253@bpk.ac.th', '123'),
(154, 72, '39254', 'ด.ญ.', 'ศิริชาดา', 'ศรีประพันธ์', '212', '39254@bpk.ac.th', '123');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `tb_ursername`
--
ALTER TABLE `tb_ursername`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `Code` (`Code`),
  ADD UNIQUE KEY `Email` (`Email`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `tb_ursername`
--
ALTER TABLE `tb_ursername`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=310;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
