-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Sep 13, 2025 at 09:33 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `saint_student_data`
--

-- --------------------------------------------------------

--
-- Table structure for table `tb_ursername`
--

CREATE TABLE `tb_ursername` (
  `id` int(11) NOT NULL,
  `Prename` int(3) NOT NULL,
  `Code` varchar(10) NOT NULL,
  `pname` varchar(10) NOT NULL,
  `name` varchar(50) NOT NULL,
  `last_name` varchar(50) NOT NULL,
  `classroom` varchar(5) NOT NULL,
  `Email` varchar(100) NOT NULL,
  `password` varchar(225) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `tb_ursername`
--

INSERT INTO `tb_ursername` (`id`, `Prename`, `Code`, `pname`, `name`, `last_name`, `classroom`, `Email`, `password`) VALUES
(1, 0, 'Code', 'pname', 'name', 'last_name', 'class', 'Email', 'password'),
(2, 1, '39352', 'ด.ช.', 'กิตติภพ', 'ช่วยนาค', '201', '39352@bpk.ac.th', '123'),
(3, 2, '39353', 'ด.ช.', 'ชนินทร', 'คณะฤทธิ์', '201', '39353@bpk.ac.th', '123'),
(4, 3, '39354', 'ด.ช.', 'ฐากร', 'สุขประสงค์', '201', '39354@bpk.ac.th', '123'),
(5, 4, '39355', 'ด.ช.', 'ณัฐวุฒิ', 'อินทร์ด้วง', '201', '39355@bpk.ac.th', '123'),
(6, 5, '39356', 'ด.ช.', 'ทวีรัชต์', 'ประสารเกตุ', '201', '39356@bpk.ac.th', '123'),
(7, 6, '39357', 'ด.ช.', 'ทิวากร', 'ส่งเสริม', '201', '39357@bpk.ac.th', '123'),
(8, 7, '39358', 'ด.ช.', 'ธนกร', 'สุวรรณเทศ', '201', '39358@bpk.ac.th', '123'),
(9, 8, '39359', 'ด.ช.', 'ธนนันท์', 'เทียนวิไลสถิต', '201', '39359@bpk.ac.th', '123'),
(10, 9, '39360', 'ด.ช.', 'ธนวัฒน์', 'บัวบังสอน', '201', '39360@bpk.ac.th', '123'),
(11, 10, '39361', 'ด.ช.', 'ธันยบูลย์', 'สาทอง', '201', '39361@bpk.ac.th', '123'),
(12, 11, '39362', 'ด.ช.', 'นราธิป', 'ตะวันเรืองรอง', '201', '39362@bpk.ac.th', '123'),
(13, 12, '39363', 'ด.ช.', 'นววัตร', 'แก้วใน', '201', '39363@bpk.ac.th', '123'),
(14, 13, '39364', 'ด.ช.', 'ปัญญากร', 'ปัญญาเหลือ', '201', '39364@bpk.ac.th', '123'),
(15, 14, '39365', 'ด.ช.', 'เปรมณัฐ', 'กิจพ่อค้า', '201', '39365@bpk.ac.th', '123'),
(16, 15, '39366', 'ด.ช.', 'พงษ์ตระกูล', 'พรมศรีจันทร์', '201', '39366@bpk.ac.th', '123'),
(17, 16, '39367', 'ด.ช.', 'พัชรพล', 'เทียนจันทร์', '201', '39367@bpk.ac.th', '123'),
(18, 17, '39368', 'ด.ช.', 'ยุทธกานต์', 'ปัญจพล', '201', '39368@bpk.ac.th', '123'),
(19, 18, '39369', 'ด.ช.', 'วทัญญู', 'กลิ่นเทียน', '201', '39369@bpk.ac.th', '123'),
(20, 19, '39370', 'ด.ช.', 'อลงกรณ์', 'จันทร์เพ็ญ', '201', '39370@bpk.ac.th', '123'),
(21, 20, '39371', 'ด.ช.', 'ธนกฤต', 'โมฆรัตน์', '201', '39371@bpk.ac.th', '123'),
(22, 21, '39379', 'ด.ช.', 'ติณณภพ', 'ดีพัฒน์', '201', '39379@bpk.ac.th', '123'),
(23, 22, '39372', 'ด.ญ.', 'กัญญาพัชร์', 'ภาคย์วิพุธ', '201', '39372@bpk.ac.th', '123'),
(24, 23, '39373', 'ด.ญ.', 'กัญญาภัค', 'ทองศรี', '201', '39373@bpk.ac.th', '123'),
(25, 24, '39374', 'ด.ญ.', 'กานต์ธิดา', 'นิลศรี', '201', '39374@bpk.ac.th', '123'),
(26, 25, '39375', 'ด.ญ.', 'ฐิติมา', 'สุวรรณประเสริฐ', '201', '39375@bpk.ac.th', '123'),
(27, 26, '39376', 'ด.ญ.', 'ณัฐณิชา', 'เวชกรณ์', '201', '39376@bpk.ac.th', '123'),
(28, 27, '39377', 'ด.ญ.', 'ณัฐนรี', 'ใจสูง', '201', '39377@bpk.ac.th', '123'),
(29, 28, '39378', 'ด.ญ.', 'ดรัลพร', 'ก่อทอง', '201', '39378@bpk.ac.th', '123'),
(30, 29, '39380', 'ด.ญ.', 'ธิรนันท์', 'แสงดี', '201', '39380@bpk.ac.th', '123'),
(31, 30, '39381', 'ด.ญ.', 'บุญญาฤทธิ์', 'โสพันขัน', '201', '39381@bpk.ac.th', '123'),
(32, 31, '39382', 'ด.ญ.', 'บุณยลักษณ์', 'สุขขาว', '201', '39382@bpk.ac.th', '123'),
(33, 32, '39383', 'ด.ญ.', 'ปริยากร', 'ยุทธิกาล', '201', '39383@bpk.ac.th', '123'),
(34, 33, '39384', 'ด.ญ.', 'ปวีณา', 'สิริโพธิ์ไพศาล', '201', '39384@bpk.ac.th', '123'),
(35, 34, '39385', 'ด.ญ.', 'ปัณณธร', 'สุพรรณโรจน์', '201', '39385@bpk.ac.th', '123'),
(36, 35, '39386', 'ด.ญ.', 'พัทธนันท์', 'ชูสุวรรณอัมพร', '201', '39386@bpk.ac.th', '123'),
(37, 36, '39387', 'ด.ญ.', 'พิชยา', 'มาศวิจิตร', '201', '39387@bpk.ac.th', '123'),
(38, 37, '39388', 'ด.ญ.', 'ภคพร', 'พัฒนวรานนท์', '201', '39388@bpk.ac.th', '123'),
(39, 38, '39389', 'ด.ญ.', 'วรัญญา', 'ฉลอยฉิ่ม', '201', '39389@bpk.ac.th', '123'),
(40, 39, '39390', 'ด.ญ.', 'วสา', 'กางกรณ์', '201', '39390@bpk.ac.th', '123'),
(41, 40, '39391', 'ด.ญ.', 'อารยา', 'เดชเกตุ', '201', '39391@bpk.ac.th', '123'),
(42, 41, '39472', 'ด.ช.', 'โกสินทร์', 'มุ่งเจริญ', '204', '39472@bpk.ac.th', '123'),
(43, 42, '39473', 'ด.ช.', 'จิรวัฒน์', 'คำมี', '204', '39473@bpk.ac.th', '123'),
(44, 43, '39474', 'ด.ช.', 'จิรวัฒน์', 'ภูบรรทัด', '204', '39474@bpk.ac.th', '123'),
(45, 44, '39475', 'ด.ช.', 'ฐิติกร', 'กองโสม', '204', '39475@bpk.ac.th', '123'),
(46, 45, '39476', 'ด.ช.', 'ณัฐวุฒิ', 'สุขสายทอง', '204', '39476@bpk.ac.th', '123'),
(47, 46, '39477', 'ด.ช.', 'ตฤณรภัทร์', 'ชมกลิ่น', '204', '39477@bpk.ac.th', '123'),
(48, 47, '39478', 'ด.ช.', 'ธนวัฒน์', 'รังสฤษฎ์วีระโชติ', '204', '39478@bpk.ac.th', '123'),
(49, 48, '39479', 'ด.ช.', 'ธาวิน', 'ศรีคำมูล', '204', '39479@bpk.ac.th', '123'),
(50, 49, '39480', 'ด.ช.', 'บวรกวินท์', 'จามิกร', '204', '39480@bpk.ac.th', '123'),
(51, 50, '39481', 'ด.ช.', 'พิษณุ', 'มีพร้อม', '204', '39481@bpk.ac.th', '123'),
(52, 51, '39482', 'ด.ช.', 'พีรพงศ์', 'ซือสูงเนิน', '204', '39482@bpk.ac.th', '123'),
(53, 52, '39483', 'ด.ช.', 'พุทธารักษ์', 'ขวัญยืน', '204', '39483@bpk.ac.th', '123'),
(54, 53, '39484', 'ด.ช.', 'ภีมากร', 'น้องดี', '204', '39484@bpk.ac.th', '123'),
(55, 54, '39485', 'ด.ช.', 'ภูมิพัฒน์', 'ฤกษ์สันทัด', '204', '39485@bpk.ac.th', '123'),
(56, 55, '39486', 'ด.ช.', 'ยศกร', 'โพธิ์รัตน์', '204', '39486@bpk.ac.th', '123'),
(57, 56, '39487', 'ด.ช.', 'ยุทธชัย', 'ตาไธสง', '204', '39487@bpk.ac.th', '123'),
(58, 57, '39488', 'ด.ช.', 'ราเมศ', 'ชิณวงษ์', '204', '39488@bpk.ac.th', '123'),
(59, 58, '39489', 'ด.ช.', 'ศุทธสิทธิ์', 'ฐิติกาญจนคุณ', '204', '39489@bpk.ac.th', '123'),
(60, 59, '39490', 'ด.ช.', 'สร้างสรรค์', 'นัยนิตย์', '204', '39490@bpk.ac.th', '123'),
(61, 60, '39491', 'ด.ช.', 'ธนดล', 'แสนทวีสุข', '204', '39491@bpk.ac.th', '123'),
(62, 61, '39495', 'ด.ช.', 'พีรวิชญ์', 'คณาศรี', '204', '39495@bpk.ac.th', '123'),
(63, 62, '39492', 'ด.ญ.', 'กชมน', 'สิวะกรเสถียร', '204', '39492@bpk.ac.th', '123'),
(64, 63, '39493', 'ด.ญ.', 'กัญญาภัทร', 'อนุชิตสกุล', '204', '39493@bpk.ac.th', '123'),
(65, 64, '39494', 'ด.ญ.', 'กัลยรัตน์', 'ชาญประเสริฐ', '204', '39494@bpk.ac.th', '123'),
(66, 65, '39496', 'ด.ญ.', 'ญาณิดา', 'อาศัยราช', '204', '39496@bpk.ac.th', '123'),
(67, 66, '39497', 'ด.ญ.', 'ณัชชา', 'จำปาทอง', '204', '39497@bpk.ac.th', '123'),
(68, 67, '39498', 'ด.ญ.', 'ชุติกานต์', 'กลัดประสริฐ', '204', '39498@bpk.ac.th', '123'),
(69, 68, '39499', 'ด.ญ.', 'ณัฐรดา', 'แซ่ลิ้ม', '204', '39499@bpk.ac.th', '123'),
(70, 69, '39500', 'ด.ญ.', 'ณิชมล', 'ดิลกเลิศพลากร', '204', '39500@bpk.ac.th', '123'),
(71, 70, '39501', 'ด.ญ.', 'นภัสกรณ์', 'พรมณี', '204', '39501@bpk.ac.th', '123'),
(72, 71, '39502', 'ด.ญ.', 'ปัณพร', 'หอมสนิท', '204', '39502@bpk.ac.th', '123'),
(73, 72, '39503', 'ด.ญ.', 'ปิญาภรณ์', 'ธาตะนะ', '204', '39503@bpk.ac.th', '123'),
(74, 73, '39504', 'ด.ญ.', 'ภูษณิศา', 'เย็นที่', '204', '39504@bpk.ac.th', '123'),
(75, 74, '39505', 'ด.ญ.', 'มณชญา', 'มนตรีกุล ณ อยุธยา', '204', '39505@bpk.ac.th', '123'),
(76, 75, '39506', 'ด.ญ.', 'มณีรินทร์', 'วันทะสิงห์', '204', '39506@bpk.ac.th', '123'),
(77, 76, '39507', 'ด.ญ.', 'วรรณรดา', 'เก่งเดช', '204', '39507@bpk.ac.th', '123'),
(78, 77, '39508', 'ด.ญ.', 'วรัสยา', 'วารุณีวรรณ์', '204', '39508@bpk.ac.th', '123'),
(79, 78, '39509', 'ด.ญ.', 'วิชญาดา', 'แต้เจริญ', '204', '39509@bpk.ac.th', '123'),
(80, 79, '39510', 'ด.ญ.', 'ศุภาณัน', 'เกียนทอง', '204', '39510@bpk.ac.th', '123'),
(81, 80, '39511', 'ด.ญ.', 'อธิชา', 'เพชรรัตน์', '204', '39511@bpk.ac.th', '123');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `tb_ursername`
--
ALTER TABLE `tb_ursername`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `Code` (`Code`),
  ADD UNIQUE KEY `Email` (`Email`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `tb_ursername`
--
ALTER TABLE `tb_ursername`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=82;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
